---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPathType.FullStepArrow
source: html/b1549a36-1d99-7920-df34-b0d7cffc4545.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType.FullStepArrow Property

True if the arrow fills the full step width, false if it fills by the specified arrow size.

## Syntax (C#)
```csharp
public bool FullStepArrow { get; set; }
```